app/controllers/activities_controller.rb

SELECT  "activities".* FROM "activities" LIMIT ? OFFSET ?  [["LIMIT", 7], ["OFFSET", 0]]
SELECT COUNT(*) FROM "activities"
---
  def index
    @activities = Activity.page(params[:page]).per(7)

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @activity = Activity.find(params[:id])

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @activity = Activity.find(params[:id])

INSERT INTO "activities" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "afd"], ["description", "dfas"], ["created_at", 2017-03-18 21:23:45 UTC], ["updated_at", 2017-03-18 21:23:45 UTC]]
---
  def create
    @activity = Activity.new(activity_params)
    if @activity.save

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "activities" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "activities"."id" = ?  [["title", "afd"], ["description", "ads"], ["updated_at", 2017-03-18 21:44:57 UTC], ["id", 3]]
---
  def update
    @activity = Activity.find(params[:id])
    if @activity.update(activity_params)

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "activities" WHERE "activities"."id" = ?  [["id", 4]]
---
  def destroy
    @activity = Activity.find(params[:id])
    @activity.destroy