app/controllers/filees_controller.rb

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "filees".* FROM "filees" WHERE "filees"."activity_id" = ? AND "filees"."id" = ? LIMIT ?  [["activity_id", 7], ["id", 13], ["LIMIT", 1]]
DELETE FROM "filees" WHERE "filees"."id" = ?  [["id", 13]]
---
  def destroy
    @activity = Activity.find(params[:activity_id])
    @filee = @activity.filees.find(params[:id])
    @filee.destroy

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
INSERT INTO "filees" ("name", "attachment", "activity_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "fdgd"], ["attachment", "ex_f3.pps"], ["activity_id", 9], ["created_at", 2017-05-16 12:43:06 UTC], ["updated_at", 2017-05-16 12:43:06 UTC]]
---
  def create
    @activity = Activity.find(params[:activity_id])
    @filee = @activity.filees.create(resume_params)