app/controllers/main_controller.rb

  def index
    @notes = Note.last(10).reverse
---
SELECT  "notes".* FROM "notes" ORDER BY "notes"."id" DESC LIMIT ?  [["LIMIT", 10]]