app/controllers/notes_controller.rb

  def new
    @activity = Activity.find(params[:activity_id])
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def update
    @activity = Activity.find(params[:activity_id])
    @note = Note.find(params[:id])
    if @note.update(note_params)
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]
UPDATE "notes" SET "annotation" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["annotation", "xxxxxxxxxxxxxxx"], ["updated_at", 2017-05-23 09:17:27 UTC], ["id", 33]]

  def create
    @activity = Activity.find(params[:activity_id])
    @note = @activity.notes.create(note_params)
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "notes" ("title", "annotation", "activity_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "dfas"], ["annotation", "fasdfas"], ["activity_id", 1], ["created_at", 2017-03-18 22:02:25 UTC], ["updated_at", 2017-03-18 22:02:25 UTC]]

  def edit
    @activity = Activity.find(params[:activity_id])
    @note = Note.find(params[:id])
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def destroy
    @activity = Activity.find(params[:activity_id])
    @note = @activity.notes.find(params[:id])
    @note.destroy
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "notes".* FROM "notes" WHERE "notes"."activity_id" = ? AND "notes"."id" = ? LIMIT ?  [["activity_id", 5], ["id", 2], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 2]]