app/views/activities/show.html.erb

    <div class="row">
      <% @activity.notes.each do |note| %>
---
SELECT "notes".* FROM "notes" WHERE "notes"."activity_id" = ?  [["activity_id", 1]]